Revit 2024 API
IFCFileWriteOptions Constructor
 Creates a default IFCFileWriteOptions. The default file format is ifc.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IFCFileWriteOptions()
Visual Basic
Public Sub New
Visual C++
public:
IFCFileWriteOptions()
See Also
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace